Revit 2024 API
DocumentVersion.IsEqual Method
 Checks whether two DocumentVersions are identical. They are identical if both the GUID and number of saves are equal. If two DocumentVersions are identical, they come from the same document, with the same set of changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsEqual(
	DocumentVersion other
)
Visual Basic
Public Function IsEqual ( _
	other As DocumentVersion _
) As Boolean
Visual C++
public:
bool IsEqual(
	DocumentVersion^ other
)
Parameters
other
Type: Autodesk.Revit.DB.DocumentVersion
 The DocumentVersion to compare to this DocumentVersion.
Return Value
 True if the two DocumentVersions are equal. False otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DocumentVersion Class
Autodesk.Revit.DB Namespace